* ~etool~ Docker
  :PROPERTIES:
  :header-args+: :dir  docker/etool
  :header-args+: :var  ETOOL_DOCKER_TAG="10"
  :END:


** Build  ~marcus2002/etool~ 


#+BEGIN_SRC bash :eval no-export :results output :exports output
echo Current ETOOL_DOCKER_TAG=$ETOOL_DOCKER_TAG
#+END_SRC

#+RESULTS:
: Current ETOOL_DOCKER_TAG=9

Build ~marcus2002/etool:$ETOOL_DOCKER_TAG~

#+BEGIN_SRC bash :eval no-export :results output :exports code
echo $ETOOL_DOCKER_TAG > VERSION
docker build -t marcus2002/etool:$ETOOL_DOCKER_TAG .  2>&1; echo $?
#+END_SRC

#+RESULTS:
#+begin_example
Sending build context to Docker daemon  656.4kB
Step 1/32 : FROM ubuntu:18.04@sha256:3235326357dfb65f1781dbc4df3b834546d8bf914e82cce58e6e6b676e23ce8f
 ---> c3c304cb4f22
Step 2/32 : RUN      apt-get update &&      apt-get install -y      curl      wget      git      firefox      gnupg2  gnupg
 ---> Using cache
 ---> 5189da15e70e
Step 3/32 : RUN       apt-get install -y       build-essential       linux-headers-4.15.0-202.generic       dkms
 ---> Using cache
 ---> 14124c10aa98
Step 4/32 : ENV LANG C.UTF-8
 ---> Using cache
 ---> 954ec985cfbf
Step 5/32 : ENV TZ=Europe/Helsinki
 ---> Using cache
 ---> 787071c68dc1
Step 6/32 : RUN ln -snf /usr/share/zoneinfo/$TZ /etc/localtime && echo $TZ > /etc/timezone
 ---> Using cache
 ---> 132b1c3f856f
Step 7/32 : RUN apt-get -y install     tzdata
 ---> Using cache
 ---> 598738866c50
Step 8/32 : RUN     sudo cp /etc/apt/sources.list /etc/apt/sources.list.orig     &&   sed -i -e'/bionic main restricted/s!# deb-src!deb-src!'                       -e'/bionic-updates main restricted/s!# deb-src!deb-src!'                 -e'/bionic universe/s!# deb-src!deb-src!'                 -e'/bionic-updates universe/s!# deb-src!deb-src!'                 /etc/apt/sources.list     && apt-get update
 ---> Using cache
 ---> 95146c636e85
Step 9/32 : RUN apt-get -y install    devscripts    build-essential     dpkg-dev    debhelper    dh-python    libudev-dev    libxenomai-dev    tcl8.6-dev    tk8.6-dev    libreadline-gplv2-dev    asciidoc dblatex    docbook-xsl    dvipng    graphviz    groff    inkscape    python-lxml    source-highlight    w3c-linkchecker    xsltproc    texlive-extra-utils    texlive-font-utils    texlive-fonts-recommended texlive-lang-cyrillic texlive-lang-french texlive-lang-german texlive-lang-polish texlive-lang-spanish    texlive-latex-recommended asciidoc-dblatex python python-dev python-tk libxmu-dev    libglu1-mesa-dev libgl1-mesa-dev    libgtk2.0-dev intltool autoconf libboost-python-dev    libmodbus-dev    libusb-1.0-0-dev yapps2    iptables netcat psmisc desktop-file-utils
 ---> Using cache
 ---> b964bb71aa8e
Step 10/32 : RUN     git clone https://github.com/LinuxCNC/linuxcnc.git emc     && cd emc     && git checkout 2.8
 ---> Using cache
 ---> 7547aac1591a
Step 11/32 : RUN diff /etc/apt/sources.list /etc/apt/sources.list.orig 2>&1; echo $?
 ---> Using cache
 ---> 90a7c6f9df46
Step 12/32 : RUN apt-get install -y              bwidget              libtk-img              tclx              python-gtk2
 ---> Using cache
 ---> 1614a7ad8baa
Step 13/32 : RUN    cd emc    && debian/configure uspace    && dpkg-checkbuilddeps    && cd src    && ./autogen.sh    && ./configure --with-realtime=uspace    && make
 ---> Using cache
 ---> bf13f02f6b85
Step 14/32 : RUN      git clone  https://github.com/pcb2gcode/pcb2gcode      && cd pcb2gcode      && git checkout e53eae9b8d490f76be6d1716dcf3b6c0ff5aad92
 ---> Using cache
 ---> fba230890e23
Step 15/32 : RUn apt-get install -y              build-essential              automake              autoconf              autoconf-archive              libtool              libboost-program-options-dev              libgtkmm-2.4-dev              gerbv              librsvg2-dev
 ---> Using cache
 ---> eed2081142ab
Step 16/32 : RUN         cd /pcb2gcode      && autoreconf -fvi      && ./configure      &&  make      && make install
 ---> Using cache
 ---> 9bc75ab0e2bd
Step 17/32 : RUN      apt-get install -y           mesa-utils           libgl1-mesa-glx
 ---> Using cache
 ---> 628a46d7bd4d
Step 18/32 : RUN       wget https://repo.anaconda.com/miniconda/Miniconda3-py38_4.10.3-Linux-x86_64.sh      && chmod +x Miniconda3-py38_4.10.3-Linux-x86_64.sh      && ./Miniconda3-py38_4.10.3-Linux-x86_64.sh  -b -p /miniconda
 ---> Using cache
 ---> 2afda6961c31
Step 19/32 : ENV PATH=/miniconda/bin:${PATH}
 ---> Using cache
 ---> fb52be36aad1
Step 20/32 : COPY image-to-gcode.yaml /miniconda
 ---> Using cache
 ---> 1d956f39a328
Step 21/32 : RUN conda env create -f /miniconda/image-to-gcode.yaml
 ---> Using cache
 ---> a1f5bb4c7ae2
Step 22/32 : RUN sed -i -e 's!~/\.!/etool/!' /emc/bin/image-to-gcode
 ---> Using cache
 ---> 1374683851e2
Step 23/32 : COPY resources/ /resources
 ---> Using cache
 ---> 06354e7e2dd5
Step 24/32 : WORKDIR /etool
 ---> Using cache
 ---> 130c1a9a667e
Step 25/32 : ENV HOME=/etool
 ---> Using cache
 ---> 764be28eb5a0
Step 26/32 : RUN mkdir /etool-bin
 ---> Using cache
 ---> 81953f42d71c
Step 27/32 : RUN mkdir /etool-cnf
 ---> Using cache
 ---> 0be079909b0f
Step 28/32 : ENV PATH=/etool-bin:/emc/scripts:${PATH}
 ---> Using cache
 ---> d135a38c180e
Step 29/32 : COPY       etool.sh       adrill.sh       RELEASES       VERSION       axis_etool.ini       sim_mm.tbl       .linuxcncrc       pcb2gcode.ini       pcb2gcode-control.template       pcb2gcode-3-grooves.ini       pcb2gcode-control-3-grooves.template       pcbGcodeZprobing.py       Dockerfile       /etool-bin/
 ---> 2234f2d73af2
Step 30/32 : COPY       pcb2gcode*.ini       pcb2gcode-control*.template       /etool-cnf/
 ---> 7454f05ef5b6
Step 31/32 : ENTRYPOINT [ "etool.sh" ]
 ---> Running in 73608aa2bdaf
Removing intermediate container 73608aa2bdaf
 ---> 79091cd7d40b
Step 32/32 : CMD [ "usage"]
 ---> Running in 9675e91bd3fa
Removing intermediate container 9675e91bd3fa
 ---> 5995f0097d54
Successfully built 5995f0097d54
Successfully tagged marcus2002/etool:9
0
#+end_example






** Push to docker repo

#+BEGIN_SRC bash :eval no-export :results output :exports output
echo Current ETOOL_DOCKER_TAG=$ETOOL_DOCKER_TAG
#+END_SRC

#+RESULTS:
: Current ETOOL_DOCKER_TAG=9



 *Warning makes it public*
#+BEGIN_SRC bash :eval no-export :results output
echo docker push marcus2002/etool:$ETOOL_DOCKER_TAG
#+END_SRC

#+RESULTS:
: docker push marcus2002/etool:9


#+BEGIN_SRC bash :eval no-export :results output
docker search marcus2002
#+END_SRC

#+RESULTS:
#+begin_example
NAME                             DESCRIPTION   STARS     OFFICIAL   AUTOMATED
marcus2002/tf-gpu-checker                      0                    
marcus2002/hello                               0                    
marcus2002/yolov3tf2                           0                    
marcus2002/yolov3-tf2-training                 0                    
marcus2002/flatcam                             0                    
marcus2002/etool                               0                    
marcus2002/tensorflow-lite-api                 0                    
marcus2002/linuxcnc                            0                    
marcus2002/ebench                              0                    
#+end_example



** List docker tags

#+BEGIN_SRC bash :eval no-export :results output
  #!/usr/bin/env bash
  docker-tags() {
      arr=("$@")

      for item in "${arr[@]}";
      do
          tokenUri="https://auth.docker.io/token"
          data=("service=registry.docker.io" "scope=repository:$item:pull")
          token="$(curl --silent --get --data-urlencode ${data[0]} --data-urlencode ${data[1]} $tokenUri | jq --raw-output '.token')"
          listUri="https://registry-1.docker.io/v2/$item/tags/list"
          authz="Authorization: Bearer $token"
          result="$(curl --silent --get -H "Accept: application/json" -H "Authorization: Bearer $token" $listUri | jq --raw-output '.')"
          echo $result
      done
  }
  docker-tags marcus2002/etool
#+END_SRC

#+RESULTS:
: { "name": "marcus2002/etool", "tags": [ "1", "2", "3", "4", "5", "6", "7", "8" ] }




** Pull ubuntu:18.04 used in etool version 8

#+BEGIN_SRC bash :eval no-export :results output :var SHA="3235326357dfb65f1781dbc4df3b834546d8bf914e82cce58e6e6b676e23ce8f"
docker image pull ubuntu:18.04@sha256:$SHA
#+END_SRC

#+RESULTS:
: docker.io/library/ubuntu@sha256:3235326357dfb65f1781dbc4df3b834546d8bf914e82cce58e6e6b676e23ce8f: Pulling from library/ubuntu
: Digest: sha256:3235326357dfb65f1781dbc4df3b834546d8bf914e82cce58e6e6b676e23ce8f
: Status: Image is up to date for ubuntu@sha256:3235326357dfb65f1781dbc4df3b834546d8bf914e82cce58e6e6b676e23ce8f
: docker.io/library/ubuntu:18.04@sha256:3235326357dfb65f1781dbc4df3b834546d8bf914e82cce58e6e6b676e23ce8f


** docker history

#+BEGIN_SRC bash :eval no-export :results output
docker history marcus2002/etool:8
#+END_SRC

#+RESULTS:
#+begin_example
IMAGE          CREATED         CREATED BY                                      SIZE      COMMENT
80368670711e   5 months ago    /bin/sh -c #(nop)  CMD ["usage"]                0B        
<missing>      5 months ago    /bin/sh -c #(nop)  ENTRYPOINT ["etool.sh"]      0B        
<missing>      5 months ago    /bin/sh -c #(nop) COPY multi:977abb02a2c7029…   15.3kB    
<missing>      5 months ago    /bin/sh -c #(nop) COPY multi:7b018d1a87c5b1c…   67.5kB    
<missing>      5 months ago    /bin/sh -c #(nop)  ENV PATH=/etool-bin:/emc/…   0B        
<missing>      5 months ago    /bin/sh -c mkdir /etool-cnf                     0B        
<missing>      5 months ago    /bin/sh -c mkdir /etool-bin                     0B        
<missing>      5 months ago    /bin/sh -c #(nop)  ENV HOME=/etool              0B        
<missing>      5 months ago    /bin/sh -c #(nop) WORKDIR /etool                0B        
<missing>      5 months ago    /bin/sh -c #(nop) COPY dir:23f5a97e900936a20…   532kB     
<missing>      10 months ago   /bin/sh -c sed -i -e 's!~/\.!/etool/!' /emc/…   26.9kB    
<missing>      10 months ago   /bin/sh -c conda env create -f /miniconda/im…   736MB     
<missing>      10 months ago   /bin/sh -c #(nop) COPY file:06d9086381b2700c…   320B      
<missing>      10 months ago   /bin/sh -c #(nop)  ENV PATH=/miniconda/bin:/…   0B        
<missing>      10 months ago   /bin/sh -c wget https://repo.anaconda.com/mi…   445MB     
<missing>      10 months ago   /bin/sh -c apt-get install -y           mesa…   4.47MB    
<missing>      10 months ago   /bin/sh -c cd /pcb2gcode      && autoreconf …   237MB     
<missing>      10 months ago   /bin/sh -c apt-get install -y              b…   18.7MB    
<missing>      10 months ago   /bin/sh -c git clone  https://github.com/pcb…   89.9MB    
<missing>      10 months ago   /bin/sh -c cd emc    && debian/configure usp…   151MB     
<missing>      10 months ago   /bin/sh -c apt-get install -y              b…   10.3MB    
<missing>      10 months ago   /bin/sh -c diff /etc/apt/sources.list /etc/a…   0B        
<missing>      10 months ago   /bin/sh -c git clone https://github.com/Linu…   341MB     
<missing>      10 months ago   /bin/sh -c apt-get -y install    devscripts …   1.45GB    
<missing>      10 months ago   /bin/sh -c sudo cp /etc/apt/sources.list /et…   23.2MB    
<missing>      10 months ago   /bin/sh -c apt-get -y install     tzdata        4.15MB    
<missing>      10 months ago   /bin/sh -c ln -snf /usr/share/zoneinfo/$TZ /…   16B       
<missing>      10 months ago   /bin/sh -c #(nop)  ENV TZ=Europe/Helsinki       0B        
<missing>      10 months ago   /bin/sh -c #(nop)  ENV LANG=C.UTF-8             0B        
<missing>      10 months ago   /bin/sh -c apt-get install -y       build-es…   247MB     
<missing>      10 months ago   /bin/sh -c apt-get update &&      apt-get in…   508MB     
<missing>      2 years ago     /bin/sh -c #(nop)  CMD ["/bin/bash"]            0B        
<missing>      2 years ago     /bin/sh -c mkdir -p /run/systemd && echo 'do…   7B        
<missing>      2 years ago     /bin/sh -c set -xe   && echo '#!/bin/sh' > /…   745B      
<missing>      2 years ago     /bin/sh -c [ -z "$(apt-get indextargets)" ]     987kB     
<missing>      2 years ago     /bin/sh -c #(nop) ADD file:c3e6bb316dfa6b81d…   63.2MB    
#+end_example


* Notes

** Issue: Unable to locate package linux-headers-5.15.0-58-generic

#+BEGIN_SRC bash :eval no-export :results output  :dir /sudo::
sudo apt search linux-headers
#+END_SRC

#+RESULTS:
#+begin_example
Sorting... 0%Sorting... 0%Sorting... 0%Sorting... Done
Full Text Search... 50%Full Text Search... 50%Full Text Search... Done
[32mlinux-headers-5.15.0-1001-gkeop[0m/jammy-updates,jammy-security 5.15.0-1001.2 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1002-gke[0m/jammy 5.15.0-1002.2 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1002-gkeop[0m/jammy-updates,jammy-security 5.15.0-1002.4 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1002-ibm[0m/jammy 5.15.0-1002.2 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1002-oracle[0m/jammy 5.15.0-1002.4 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1003-azure[0m/jammy 5.15.0-1003.4 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1003-gcp[0m/jammy 5.15.0-1003.6 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1003-gke[0m/jammy-updates,jammy-security 5.15.0-1003.3 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1003-gkeop[0m/jammy-updates,jammy-security 5.15.0-1003.5 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1003-ibm[0m/jammy-updates,jammy-security 5.15.0-1003.3 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1003-oracle[0m/jammy-updates,jammy-security 5.15.0-1003.5 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1004-aws[0m/jammy 5.15.0-1004.6 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1004-gcp[0m/jammy-updates,jammy-security 5.15.0-1004.7 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1004-gke[0m/jammy-updates 5.15.0-1004.5 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1004-gkeop[0m/jammy-updates,jammy-security 5.15.0-1004.6 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1004-ibm[0m/jammy-updates,jammy-security 5.15.0-1004.4 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1004-intel-iotg[0m/jammy 5.15.0-1004.6 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1004-kvm[0m/jammy 5.15.0-1004.4 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1005-aws[0m/jammy-updates,jammy-security 5.15.0-1005.7 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1005-azure[0m/jammy-updates,jammy-security 5.15.0-1005.6 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1005-gcp[0m/jammy-updates,jammy-security 5.15.0-1005.8 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1005-gke[0m/jammy-updates,jammy-security 5.15.0-1005.6 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1005-gkeop[0m/jammy-updates,jammy-security 5.15.0-1005.7 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1005-ibm[0m/jammy-updates 5.15.0-1005.5 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1005-kvm[0m/jammy-updates,jammy-security 5.15.0-1005.5 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1005-nvidia[0m/jammy-updates,jammy-security 5.15.0-1005.5 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1006-gcp[0m/jammy-updates 5.15.0-1006.9 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1006-gke[0m/jammy-updates 5.15.0-1006.7 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1006-oracle[0m/jammy-updates,jammy-security 5.15.0-1006.8 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1007-azure[0m/jammy-updates,jammy-security 5.15.0-1007.8 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1007-gkeop[0m/jammy-updates,jammy-security 5.15.0-1007.10 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1007-ibm[0m/jammy-updates,jammy-security 5.15.0-1007.8 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1007-kvm[0m/jammy-updates,jammy-security 5.15.0-1007.7 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1007-nvidia[0m/jammy-updates,jammy-security 5.15.0-1007.7 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1007-nvidia-lowlatency[0m/jammy-updates,jammy-security 5.15.0-1007.7 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1007-oracle[0m/jammy-updates 5.15.0-1007.9 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1008-aws[0m/jammy-updates,jammy-security 5.15.0-1008.10 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1008-azure[0m/jammy-updates 5.15.0-1008.9 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1008-gcp[0m/jammy-updates,jammy-security 5.15.0-1008.12 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1008-gke[0m/jammy-updates,jammy-security 5.15.0-1008.10 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1008-gkeop[0m/jammy-updates,jammy-security 5.15.0-1008.12 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1008-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1008.11 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1008-kvm[0m/jammy-updates 5.15.0-1008.8 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1009-aws[0m/jammy-updates 5.15.0-1009.11 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1009-ibm[0m/jammy-updates,jammy-security 5.15.0-1009.11 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1009-oracle[0m/jammy-updates,jammy-security 5.15.0-1009.12 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1010-azure[0m/jammy-updates,jammy-security 5.15.0-1010.12 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1010-gcp[0m/jammy-updates,jammy-security 5.15.0-1010.15 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1010-gke[0m/jammy-updates,jammy-security 5.15.0-1010.13 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1010-ibm[0m/jammy-updates,jammy-security 5.15.0-1010.12 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1010-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1010.14 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1010-kvm[0m/jammy-updates,jammy-security 5.15.0-1010.11 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1010-nvidia[0m/jammy-updates,jammy-security 5.15.0-1010.10 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1010-nvidia-lowlatency[0m/jammy-updates,jammy-security 5.15.0-1010.10 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1011-aws[0m/jammy-updates,jammy-security 5.15.0-1011.14 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1011-gke[0m/jammy-updates,jammy-security 5.15.0-1011.14 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1011-gkeop[0m/jammy-updates,jammy-security 5.15.0-1011.15 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1011-oracle[0m/jammy-updates,jammy-security 5.15.0-1011.15 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1012-azure[0m/jammy-updates,jammy-security 5.15.0-1012.15 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1012-gkeop[0m/jammy-updates,jammy-security 5.15.0-1012.16 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1012-ibm[0m/jammy-updates,jammy-security 5.15.0-1012.14 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1012-kvm[0m/jammy-updates,jammy-security 5.15.0-1012.14 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1013-aws[0m/jammy-updates,jammy-security 5.15.0-1013.17 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1013-azure[0m/jammy-updates 5.15.0-1013.16 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1013-gcp[0m/jammy-updates,jammy-security 5.15.0-1013.18 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1013-gkeop[0m/jammy-updates,jammy-security 5.15.0-1013.17 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1013-ibm[0m/jammy-updates,jammy-security 5.15.0-1013.15 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1013-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1013.17 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1013-kvm[0m/jammy-updates,jammy-security 5.15.0-1013.16 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1013-oracle[0m/jammy-updates,jammy-security 5.15.0-1013.17 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1014-aws[0m/jammy-updates 5.15.0-1014.18 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1014-azure[0m/jammy-updates,jammy-security 5.15.0-1014.17 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1014-gke[0m/jammy-updates,jammy-security 5.15.0-1014.17 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1015-aws[0m/jammy-updates,jammy-security 5.15.0-1015.19 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1015-gke[0m/jammy-updates,jammy-security 5.15.0-1015.18 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1015-gkeop[0m/jammy-updates,jammy-security 5.15.0-1015.19 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1015-ibm[0m/jammy-updates,jammy-security 5.15.0-1015.17 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1015-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1015.20 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1015-nvidia[0m/jammy-updates,jammy-security 5.15.0-1015.15 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1015-nvidia-lowlatency[0m/jammy-updates,jammy-security 5.15.0-1015.15 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1016-gcp[0m/jammy-updates,jammy-security 5.15.0-1016.21 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1016-gke[0m/jammy-updates,jammy-security 5.15.0-1016.19 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1016-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1016.21 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1016-kvm[0m/jammy-updates,jammy-security 5.15.0-1016.19 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1016-oracle[0m/jammy-updates,jammy-security 5.15.0-1016.20 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1017-aws[0m/jammy-updates,jammy-security 5.15.0-1017.21 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1017-azure[0m/jammy-updates,jammy-security 5.15.0-1017.20 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1017-gcp[0m/jammy-updates,jammy-security 5.15.0-1017.23 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1017-gke[0m/jammy-updates,jammy-security 5.15.0-1017.20 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1017-ibm[0m/jammy-updates,jammy-security 5.15.0-1017.20 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1017-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1017.22 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1017-kvm[0m/jammy-updates,jammy-security 5.15.0-1017.21 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1017-oracle[0m/jammy-updates,jammy-security 5.15.0-1017.22 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1018-gcp[0m/jammy-updates,jammy-security 5.15.0-1018.24 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1018-ibm[0m/jammy-updates,jammy-security 5.15.0-1018.21 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1018-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1018.23 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1018-kvm[0m/jammy-updates,jammy-security 5.15.0-1018.22 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1018-oracle[0m/jammy-updates,jammy-security 5.15.0-1018.23 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1019-aws[0m/jammy-updates,jammy-security 5.15.0-1019.23 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1019-azure[0m/jammy-updates,jammy-security 5.15.0-1019.24 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1019-gcp[0m/jammy-updates,jammy-security 5.15.0-1019.25 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1019-gke[0m/jammy-updates,jammy-security 5.15.0-1019.23 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1019-kvm[0m/jammy-updates,jammy-security 5.15.0-1019.23 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1019-oracle[0m/jammy-updates,jammy-security 5.15.0-1019.24 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1020-aws[0m/jammy-updates,jammy-security 5.15.0-1020.24 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1020-azure[0m/jammy-updates,jammy-security 5.15.0-1020.25 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1020-gke[0m/jammy-updates,jammy-security 5.15.0-1020.25 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1020-kvm[0m/jammy-updates,jammy-security 5.15.0-1020.24 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1021-aws[0m/jammy-updates,jammy-security 5.15.0-1021.25 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1021-azure[0m/jammy-updates,jammy-security 5.15.0-1021.26 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1021-gcp[0m/jammy-updates,jammy-security 5.15.0-1021.28 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1021-ibm[0m/jammy-updates,jammy-security 5.15.0-1021.24 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1021-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1021.26 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1021-kvm[0m/jammy-updates,jammy-security 5.15.0-1021.26 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1021-oracle[0m/jammy-updates,jammy-security 5.15.0-1021.27 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1022-aws[0m/jammy-updates,jammy-security 5.15.0-1022.26 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1022-azure[0m/jammy-updates,jammy-security 5.15.0-1022.27 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1022-gcp[0m/jammy-updates,jammy-security 5.15.0-1022.29 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1022-ibm[0m/jammy-updates,jammy-security 5.15.0-1022.25 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1022-oracle[0m/jammy-updates,jammy-security 5.15.0-1022.28 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1023-aws[0m/jammy-updates,jammy-security 5.15.0-1023.27 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1023-azure[0m/jammy-updates,jammy-security 5.15.0-1023.29 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1023-gke[0m/jammy-updates,jammy-security 5.15.0-1023.28 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1023-ibm[0m/jammy-updates,jammy-security 5.15.0-1023.26 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1023-intel-iotg[0m/jammy-updates,jammy-security 5.15.0-1023.28 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1024-azure[0m/jammy-updates,jammy-security 5.15.0-1024.30 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1024-gke[0m/jammy-updates,jammy-security 5.15.0-1024.29 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1024-kvm[0m/jammy-updates,jammy-security 5.15.0-1024.29 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1025-gcp[0m/jammy-updates,jammy-security 5.15.0-1025.32 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1025-ibm[0m/jammy-updates,jammy-security 5.15.0-1025.28 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1025-kvm[0m/jammy-updates,jammy-security 5.15.0-1025.30 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1025-oracle[0m/jammy-updates,jammy-security 5.15.0-1025.31 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1026-aws[0m/jammy-updates,jammy-security 5.15.0-1026.30 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1026-gcp[0m/jammy-updates,jammy-security 5.15.0-1026.33 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1026-kvm[0m/jammy-updates,jammy-security 5.15.0-1026.31 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1026-oracle[0m/jammy-updates,jammy-security 5.15.0-1026.32 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1027-aws[0m/jammy-updates,jammy-security 5.15.0-1027.31 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1027-gcp[0m/jammy-updates,jammy-security 5.15.0-1027.34 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1027-gke[0m/jammy-updates,jammy-security 5.15.0-1027.32 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1027-oracle[0m/jammy-updates,jammy-security 5.15.0-1027.33 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1028-aws[0m/jammy-updates,jammy-security 5.15.0-1028.32 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1028-kvm[0m/jammy-updates,jammy-security 5.15.0-1028.33 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1029-azure[0m/jammy-updates,jammy-security 5.15.0-1029.36 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1029-oracle[0m/jammy-updates,jammy-security 5.15.0-1029.35 amd64
  Oracle Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1030-azure[0m/jammy-updates,jammy-security 5.15.0-1030.37 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1031-azure[0m/jammy-updates,jammy-security 5.15.0-1031.38 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-1033-azure[0m/jammy-updates,jammy-security 5.15.0-1033.40 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-24-lowlatency[0m/jammy 5.15.0-24.24 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-25[0m/jammy,jammy 5.15.0-25.25 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-25-generic[0m/jammy 5.15.0-25.25 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-27[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-27.28 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-27-generic[0m/jammy-updates,jammy-security 5.15.0-27.28 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-27-lowlatency[0m/jammy-updates,jammy-security 5.15.0-27.28 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-30[0m/jammy-updates,jammy-updates 5.15.0-30.31 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-30-generic[0m/jammy-updates 5.15.0-30.31 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-30-lowlatency[0m/jammy-updates 5.15.0-30.31 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-33[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-33.34 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-33-generic[0m/jammy-updates,jammy-security 5.15.0-33.34 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-33-lowlatency[0m/jammy-updates,jammy-security 5.15.0-33.34 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-35[0m/jammy-updates,jammy-updates 5.15.0-35.36 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-35-generic[0m/jammy-updates 5.15.0-35.36 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-35-lowlatency[0m/jammy-updates 5.15.0-35.36 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-37[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-37.39 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-37-generic[0m/jammy-updates,jammy-security 5.15.0-37.39 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-37-lowlatency[0m/jammy-updates,jammy-security 5.15.0-37.39 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-39[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-39.42 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-39-generic[0m/jammy-updates,jammy-security 5.15.0-39.42 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-39-lowlatency[0m/jammy-updates,jammy-security 5.15.0-39.42 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-40[0m/jammy-updates,jammy-updates 5.15.0-40.43 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-40-generic[0m/jammy-updates 5.15.0-40.43 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-40-lowlatency[0m/jammy-updates 5.15.0-40.43 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-41[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-41.44 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-41-generic[0m/jammy-updates,jammy-security 5.15.0-41.44 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-41-lowlatency[0m/jammy-updates,jammy-security 5.15.0-41.44 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-43[0m/jammy-updates,jammy-updates,jammy-security,jammy-security,now 5.15.0-43.46 all [installed,automatic]
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-43-generic[0m/jammy-updates,jammy-security,now 5.15.0-43.46 amd64 [installed,automatic]
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-43-lowlatency[0m/jammy-updates,jammy-security 5.15.0-43.46 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-46[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-46.49 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-46-generic[0m/jammy-updates,jammy-security 5.15.0-46.49 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-46-lowlatency[0m/jammy-updates,jammy-security 5.15.0-46.49 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-47[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-47.51 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-47-generic[0m/jammy-updates,jammy-security 5.15.0-47.51 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-47-lowlatency[0m/jammy-updates,jammy-security 5.15.0-47.53 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-48[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-48.54 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-48-generic[0m/jammy-updates,jammy-security 5.15.0-48.54 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-48-lowlatency[0m/jammy-updates,jammy-security 5.15.0-48.54 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-50[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-50.56 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-50-generic[0m/jammy-updates,jammy-security 5.15.0-50.56 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-50-lowlatency[0m/jammy-updates,jammy-security 5.15.0-50.56 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-52[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-52.58 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-52-generic[0m/jammy-updates,jammy-security 5.15.0-52.58 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-52-lowlatency[0m/jammy-updates,jammy-security 5.15.0-52.58 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-53[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-53.59 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-53-generic[0m/jammy-updates,jammy-security 5.15.0-53.59 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-53-lowlatency[0m/jammy-updates,jammy-security 5.15.0-53.59 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-56[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-56.62 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-56-generic[0m/jammy-updates,jammy-security 5.15.0-56.62 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-56-lowlatency[0m/jammy-updates,jammy-security 5.15.0-56.62 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-57[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-57.63 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-57-generic[0m/jammy-updates,jammy-security 5.15.0-57.63 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-57-lowlatency[0m/jammy-updates,jammy-security 5.15.0-57.63 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-58[0m/jammy-updates,jammy-updates,jammy-security,jammy-security,now 5.15.0-58.64 all [installed,automatic]
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-58-generic[0m/jammy-updates,jammy-security,now 5.15.0-58.64 amd64 [installed,automatic]
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-58-lowlatency[0m/jammy-updates,jammy-security 5.15.0-58.64 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-60[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-60.66 all
  Header files related to Linux kernel version 5.15.0

[32mlinux-headers-5.15.0-60-generic[0m/jammy-updates,jammy-security 5.15.0-60.66 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.15.0-60-lowlatency[0m/jammy-updates,jammy-security 5.15.0-60.66 amd64
  Linux kernel headers for version 5.15.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1003-oem[0m/jammy 5.17.0-1003.3 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1004-oem[0m/jammy-updates,jammy-security 5.17.0-1004.4 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1006-oem[0m/jammy-updates,jammy-security 5.17.0-1006.6 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1011-oem[0m/jammy-updates,jammy-security 5.17.0-1011.12 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1012-oem[0m/jammy-updates,jammy-security 5.17.0-1012.13 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1013-oem[0m/jammy-updates,jammy-security 5.17.0-1013.14 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1014-oem[0m/jammy-updates,jammy-security 5.17.0-1014.15 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1015-oem[0m/jammy-updates,jammy-security 5.17.0-1015.16 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1016-oem[0m/jammy-updates,jammy-security 5.17.0-1016.17 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1017-oem[0m/jammy-updates,jammy-security 5.17.0-1017.18 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1018-oem[0m/jammy-updates 5.17.0-1018.19 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1019-oem[0m/jammy-updates 5.17.0-1019.20 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1020-oem[0m/jammy-updates,jammy-security 5.17.0-1020.21 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1021-oem[0m/jammy-updates,jammy-security 5.17.0-1021.22 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1024-oem[0m/jammy-updates,jammy-security 5.17.0-1024.25 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1025-oem[0m/jammy-updates,jammy-security 5.17.0-1025.26 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1026-oem[0m/jammy-updates,jammy-security 5.17.0-1026.27 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.17.0-1027-oem[0m/jammy-updates,jammy-security 5.17.0-1027.28 amd64
  Linux kernel headers for version 5.17.0 on 64 bit x86 SMP

[32mlinux-headers-5.19.0-28-generic[0m/jammy-updates,jammy-security 5.19.0-28.29~22.04.1 amd64
  Linux kernel headers for version 5.19.0 on 64 bit x86 SMP

[32mlinux-headers-6.0.0-1006-oem[0m/jammy-updates 6.0.0-1006.6 amd64
  Linux kernel headers for version 6.0.0 on 64 bit x86 SMP

[32mlinux-headers-6.0.0-1007-oem[0m/jammy-updates,jammy-security 6.0.0-1007.7 amd64
  Linux kernel headers for version 6.0.0 on 64 bit x86 SMP

[32mlinux-headers-6.0.0-1008-oem[0m/jammy-updates,jammy-security 6.0.0-1008.8 amd64
  Linux kernel headers for version 6.0.0 on 64 bit x86 SMP

[32mlinux-headers-6.0.0-1009-oem[0m/jammy-updates 6.0.0-1009.9 amd64
  Linux kernel headers for version 6.0.0 on 64 bit x86 SMP

[32mlinux-headers-6.0.0-1010-oem[0m/jammy-updates,jammy-security 6.0.0-1010.10 amd64
  Linux kernel headers for version 6.0.0 on 64 bit x86 SMP

[32mlinux-headers-6.0.0-1011-oem[0m/jammy-updates,jammy-security 6.0.0-1011.11 amd64
  Linux kernel headers for version 6.0.0 on 64 bit x86 SMP

[32mlinux-headers-6.1.0-1004-oem[0m/jammy-updates,jammy-security 6.1.0-1004.4 amd64
  Linux kernel headers for version 6.1.0 on 64 bit x86 SMP

[32mlinux-headers-6.1.0-1006-oem[0m/jammy-updates,jammy-security 6.1.0-1006.6 amd64
  Linux kernel headers for version 6.1.0 on 64 bit x86 SMP

[32mlinux-headers-aws[0m/jammy-updates,jammy-security 5.15.0.1028.26 amd64
  Linux kernel headers for Amazon Web Services (AWS) systems.

[32mlinux-headers-aws-lts-22.04[0m/jammy-updates,jammy-security 5.15.0.1028.26 amd64
  Linux kernel headers for Amazon Web Services (AWS) systems.

[32mlinux-headers-azure[0m/jammy-updates,jammy-security 5.15.0.1033.29 amd64
  Linux kernel headers for Azure systems.

[32mlinux-headers-azure-fde[0m/jammy-updates,jammy-security 5.15.0.1031.38.8 amd64
  Linux kernel headers for Azure systems.

[32mlinux-headers-azure-fde-edge[0m/jammy-updates,jammy-security 5.15.0.1031.38.8 amd64
  Linux kernel headers for Azure systems.

[32mlinux-headers-azure-lts-22.04[0m/jammy-updates,jammy-security 5.15.0.1033.29 amd64
  Linux kernel headers for Azure systems.

[32mlinux-headers-gcp[0m/jammy-updates,jammy-security 5.15.0.1027.22 amd64
  Google Cloud Platform (GCP) Linux kernel headers

[32mlinux-headers-generic[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Generic Linux kernel headers

[32mlinux-headers-generic-hwe-20.04[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Generic Linux kernel headers (dummy transitional package)

[32mlinux-headers-generic-hwe-20.04-edge[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Generic Linux kernel headers (dummy transitional package)

[32mlinux-headers-generic-hwe-22.04[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64 [upgradable from: 5.15.0.58.56]
  Generic Linux kernel headers

[32mlinux-headers-generic-hwe-22.04-edge[0m/jammy-updates,jammy-security 5.19.0.28.29~22.04.6 amd64
  Generic Linux kernel headers

[32mlinux-headers-gke[0m/jammy-updates,jammy-security 5.15.0.1027.26 amd64
  Linux kernel headers for gke systems.

[32mlinux-headers-gke-5.15[0m/jammy-updates,jammy-security 5.15.0.1027.26 amd64
  Linux kernel headers for gke systems.

[32mlinux-headers-gkeop[0m/jammy-updates,jammy-security 5.15.0.1015.14 amd64
  Headers for the GKEOP kernel

[32mlinux-headers-gkeop-5.15[0m/jammy-updates,jammy-security 5.15.0.1015.14 amd64
  Headers for the GKEOP kernel

[32mlinux-headers-ibm[0m/jammy-updates,jammy-security 5.15.0.1025.21 amd64
  IBM Cloud Platform (ibm) Linux kernel headers

[32mlinux-headers-intel-iotg[0m/jammy-updates,jammy-security 5.15.0.1023.22 amd64
  Intel-Iotg Linux kernel headers

[32mlinux-headers-kvm[0m/jammy-updates,jammy-security 5.15.0.1028.24 amd64
  Linux kernel headers for virtual systems.

[32mlinux-headers-lowlatency[0m/jammy-updates,jammy-security 5.15.0.60.53 amd64
  lowlatency Linux kernel headers

[32mlinux-headers-lowlatency-hwe-20.04[0m/jammy-updates,jammy-security 5.15.0.60.53 amd64
  lowlatency Linux kernel headers (dummy transitional package)

[32mlinux-headers-lowlatency-hwe-20.04-edge[0m/jammy-updates,jammy-security 5.15.0.60.53 amd64
  lowlatency Linux kernel headers (dummy transitional package)

[32mlinux-headers-lowlatency-hwe-22.04[0m/jammy-updates,jammy-security 5.15.0.60.53 amd64
  lowlatency Linux kernel headers

[32mlinux-headers-lowlatency-hwe-22.04-edge[0m/jammy-updates,jammy-security 5.15.0.56.49 amd64
  lowlatency Linux kernel headers

[32mlinux-headers-nvidia[0m/jammy-updates,jammy-security 5.15.0.1015.15 amd64
  Linux kernel headers for Nvidia systems.

[32mlinux-headers-nvidia-lowlatency[0m/jammy-updates,jammy-security 5.15.0.1015.15 amd64
  Linux kernel headers for Nvidia systems.

[32mlinux-headers-oem-20.04[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  OEM Linux kernel headers (dummy transitional package)

[32mlinux-headers-oem-22.04[0m/jammy-updates,jammy-security 5.17.0.1027.25 amd64
  OEM Linux kernel headers

[32mlinux-headers-oem-22.04a[0m/jammy-updates,jammy-security 5.17.0.1027.25 amd64
  OEM Linux kernel headers

[32mlinux-headers-oem-22.04b[0m/jammy-updates,jammy-security 6.0.0.1011.11 amd64
  OEM Linux kernel headers

[32mlinux-headers-oem-22.04c[0m/jammy-updates,jammy-security 6.1.0.1006.6 amd64
  OEM Linux kernel headers

[32mlinux-headers-oracle[0m/jammy-updates,jammy-security 5.15.0.1029.24 amd64
  Linux kernel headers for Oracle systems.

[32mlinux-headers-virtual[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Virtual Linux kernel headers

[32mlinux-headers-virtual-hwe-20.04[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Virtual Linux kernel headers (dummy transitional package)

[32mlinux-headers-virtual-hwe-20.04-edge[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Virtual Linux kernel headers (dummy transitional package)

[32mlinux-headers-virtual-hwe-22.04[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Virtual Linux kernel headers

[32mlinux-headers-virtual-hwe-22.04-edge[0m/jammy-updates,jammy-security 5.19.0.28.29~22.04.6 amd64
  Virtual Linux kernel headers

[32mlinux-libc-dev[0m/jammy-updates,jammy-security 5.15.0-60.66 amd64 [upgradable from: 5.15.0-58.64]
  Linux Kernel Headers for development

[32mlinux-libc-dev-alpha-cross[0m/jammy,jammy 5.15.0-22.22cross4 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-amd64-cross[0m/jammy,jammy 5.15.0-22.22cross3 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-arm64-cross[0m/jammy,jammy 5.15.0-22.22cross3 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-armel-cross[0m/jammy,jammy 5.15.0-22.22cross3 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-armhf-cross[0m/jammy,jammy 5.15.0-22.22cross3 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-hppa-cross[0m/jammy,jammy 5.15.0-22.22cross4 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-i386-cross[0m/jammy,jammy 5.15.0-22.22cross3 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-m68k-cross[0m/jammy,jammy 5.15.0-22.22cross4 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mips-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mips64-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mips64el-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mips64r6-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mips64r6el-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mipsel-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mipsn32-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mipsn32el-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mipsn32r6-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mipsn32r6el-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mipsr6-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-mipsr6el-cross[0m/jammy,jammy 5.15.0-18.18cross1 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-powerpc-cross[0m/jammy,jammy 5.15.0-22.22cross3 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-ppc64-cross[0m/jammy,jammy 5.15.0-22.22cross4 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-ppc64el-cross[0m/jammy,jammy 5.15.0-22.22cross3 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-riscv64-cross[0m/jammy,jammy 5.15.0-22.22cross4 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-s390x-cross[0m/jammy,jammy 5.15.0-22.22cross3 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-sh4-cross[0m/jammy,jammy 5.15.0-22.22cross4 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-sparc64-cross[0m/jammy,jammy 5.15.0-22.22cross4 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-libc-dev-x32-cross[0m/jammy,jammy 5.15.0-22.22cross4 all
  Linux Kernel Headers for development (for cross-compiling)

[32mlinux-source-5.15.0[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.15.0-60.66 all
  Linux kernel source for version 5.15.0 with Ubuntu patches

[32mlinux-source-5.19.0[0m/jammy-updates,jammy-updates,jammy-security,jammy-security 5.19.0-28.29~22.04.1 all
  Linux kernel source for version 5.19.0 with Ubuntu patches

[32mlinux-virtual[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Minimal Generic Linux kernel and headers

[32mlinux-virtual-hwe-22.04[0m/jammy-updates,jammy-security 5.15.0.60.58 amd64
  Minimal Generic Linux kernel and headers

[32mlinux-virtual-hwe-22.04-edge[0m/jammy-updates,jammy-security 5.19.0.28.29~22.04.6 amd64
  Minimal Generic Linux kernel and headers

#+end_example



* Fin                                                              :noexport:

** Emacs variables

   #+RESULTS:

   # Local Variables:
   # org-confirm-babel-evaluate: nil
   # End:
   #
   # Muuta 
   # org-cdlatex-mode: t
   # eval: (cdlatex-mode)
   #
   # Local ebib:
   # org-ref-default-bibliography: "./pcb-milling.bib"
   # org-ref-bibliography-notes: "./pcb-milling-notes.org"
   # org-ref-pdf-directory: "./pdf/"
   # org-ref-notes-directory: "."
   # bibtex-completion-notes-path: "./pcb-milling-notes.org"
   # ebib-preload-bib-files: ("./pcb-milling.bib")
   # ebib-notes-file: ("./pcb-milling-notes.org")
   # reftex-default-bibliography: ("./pcb-milling.bib")



